{
  "auth": {
    "signIn": {
      "title": "Увійти",
      "subtitle": "Увійдіть, щоб перейти до Chatium.",
      "buttonTitle": "Увійти",
      "checkBoxRemember": "Запам'ятати мене",
      "footerText": "Не маєте облікового запису?",
      "footerLink": "Зареєструватися зараз"
    },
    "signUp": {
      "title": "Зареєструватися",
      "subtitle": "Отримайте свій обліковий запис Chatium зараз.",
      "buttonTitle": "Зареєструватися",
      "footerText": "Вже маєте обліковий запис?",
      "footerLink": "Увійти"
    },
    "formLabels": {
      "name": "Ім'я",
      "email": "Електронна пошта",
      "password": "Пароль",
      "confirmPassword": "Підтвердити пароль"
    },
    "validError": {
      "required": "Поле обов'язкове",
      "space": "Поле не може містити пробіли",
      "email": "Недійсна електронна адреса",
      "shortPassword": "Пароль має бути довшим за 6 символів!",
      "longPassword": "Пароль має бути коротшим за 16 символів!",
      "lowerCase": "Пароль має містити принаймні 1 малу літеру",
      "upperCase": "Пароль має містити принаймні 1 велику літеру",
      "number": "Пароль має містити принаймні 1 цифру",
      "symbols": "Пароль не повинен містити спеціальних символів",
      "passwordDoesNotMatch": "Пароль не збігається"
    },
    "serverError": {
      "admin-restricted-operation": "Ця операція доступна лише адміністраторам.",
      "app-not-authorized": "Ця програма, визначена доменом, де вона розміщена, не має права використовувати автентифікацію Firebase із наданим ключем API. Перегляньте конфігурацію ключа в консолі Google API.",
      "app-not-installed": "Потрібна мобільна програма, яка відповідає наданому ідентифікатору (назва пакета Android або ідентифікатор пакета iOS), не встановлена ​​на цьому пристрої.",
      "captcha-check-failed": "Наданий токен відповіді reCAPTCHA недійсний, прострочений, уже використаний або пов’язаний із ним домен не відповідає списку білих доменів.",
      "code-expired": "Термін дії SMS-коду закінчився. Будь ласка, надішліть код підтвердження ще раз, щоб повторити спробу.",
      "cordova-not-ready": "Фреймворк Cordova не готовий.",
      "cors-unsupported": "Цей браузер не підтримується.",
      "credential-already-in-use": "Ці облікові дані вже пов'язані з іншим обліковим записом користувача.",
      "custom-token-mismatch": "Спеціальний маркер відповідає іншій аудиторії.",
      "requires-recent-login": "Ця операція є конфіденційною та вимагає нещодавньої автентифікації. Увійдіть ще раз, перш ніж повторити цей запит.",
      "dynamic-link-not-activated": "Будь ласка, активуйте динамічні посилання в консолі Firebase і погодьтеся з положеннями та умовами.",
      "email-change-needs-verification": "Багатофакторні користувачі завжди повинні мати підтверджену електронну адресу.",
      "email-already-in-use": "Адреса електронної пошти вже використовується іншим обліковим записом.",
      "expired-action-code": "Термін дії коду дії минув. ",
      "cancelled-popup-request": "Цю операцію скасовано через відкриття іншого конфліктного спливаючого вікна.",
      "internal-error": "Сталася внутрішня помилка.",
      "invalid-app-credential": "Запит на перевірку телефону містить недійсний засіб перевірки програми. Відповідь токена reCAPTCHA недійсна або термін дії минув.",
      "invalid-app-id": "Ідентифікатор мобільної програми не зареєстровано для поточного проекту.",
      "invalid-user-token": "Облікові дані цього користувача недійсні для цього проекту. Це може статися, якщо маркер користувача підроблено або якщо користувач не для проекту, пов’язаного з цим ключем API.",
      "invalid-auth-event": "Сталася внутрішня помилка.",
      "invalid-verification-code": "Код підтвердження SMS, використаний для створення облікових даних для автентифікації телефону, недійсний. Повторно надішліть SMS із кодом підтвердження та обов’язково використовуйте код підтвердження, наданий користувачем.",
      "invalid-continue-uri": "URL продовження, наданий у запиті, недійсний.",
      "invalid-cordova-configuration": "Щоб увімкнути вхід OAuth, потрібно встановити такі плагіни Cordova: інформація про збірку cordova-plugin, плагін cordova-universal-links, вкладка браузера cordova-plugin, cordova-plugin-in веб-переглядач програми та користувацька схема URL-адреси плагіна cordova.",
      "invalid-custom-token": "Неправильний формат спеціального маркера. Перевірте документацію.",
      "invalid-dynamic-link-domain": "Наданий домен динамічного посилання не налаштований або авторизований для поточного проекту.",
      "invalid-email": "Адреса електронної пошти має неправильний формат.",
      "invalid-api-key": "Ваш ключ API недійсний, переконайтеся, що ви його правильно скопіювали.",
      "invalid-cert-hash": "Наданий хеш сертифіката SHA-1 недійсний.",
      "invalid-credential": "Надані облікові дані автентифікації неправильні або термін їх дії закінчився.",
      "invalid-message-payload": "Шаблон електронної пошти, який відповідає цій дії, містить неприпустимі символи у своєму повідомленні. Виправте це, перейшовши до розділу Auth email templates у Firebase Console.",
      "invalid-multi-factor-session": "Запит не містить дійсного підтвердження успішного входу за першим фактором.",
      "invalid-oauth-provider": "EmailAuthProvider не підтримується для цієї операції. Ця операція підтримує лише постачальників OAuth.",
      "invalid-oauth-client-id": "Наданий ідентифікатор клієнта OAuth недійсний або не відповідає вказаному ключу API.",
      "unauthorized-domain": "Цей домен не авторизовано для операцій OAuth для вашого проекту Firebase. Відредагуйте список авторизованих доменів на консолі Firebase.",
      "invalid-action-code": "Код дії недійсний. Це може статися, якщо код неправильно сформований, прострочений або вже використаний.",
      "wrong-password": "Пароль недійсний або користувач не має пароля.",
      "invalid-persistence-type": "Вказаний тип збереження недійсний. Він може бути лише локальним, сеансовим або жодним.",
      "invalid-phone-number": "Формат наданого номера телефону є неправильним. Введіть номер телефону у форматі, який можна розібрати у формат E.164. Номери телефонів E.164 записуються у форматі [+] [код країни][номер абонента, включаючи код міста].",
      "invalid-provider-id": "Вказаний ідентифікатор постачальника недійсний.",
      "invalid-recipient-email": "Не вдалося надіслати електронний лист, який відповідає цій дії, оскільки надана адреса електронної пошти одержувача недійсна.",
      "invalid-sender": "Шаблон електронної пошти, що відповідає цій дії, містить недійсну електронну адресу або ім’я відправника. Виправте це, перейшовши до розділу Auth email templates у Firebase Console.",
      "invalid-verification-id": "Ідентифікатор перевірки, використаний для створення облікових даних телефону, недійсний.",
      "invalid-tenant-id": "Ідентифікатор клієнта примірника Auth недійсний.",
      "multi-factor-info-not-found": "Користувач не має другого фактора, який відповідає наданому ідентифікатору.",
      "multi-factor-auth-required": "Для завершення входу потрібне підтвердження права власності на другий фактор",
      "missing-android-pkg-name": "Потрібно вказати назву пакета Android, якщо потрібно встановити програму Android.",
      "auth-domain-config-required": "Обов’язково включайте authDomain під час виклику firebase.initializeApp(), дотримуючись інструкцій у консолі Firebase.",
      "missing-app-credential": "У запиті на перевірку телефону відсутнє твердження верифікатора програми. Необхідно надати маркер відповіді reCAPTCHA.",
      "missing-verification-code": "Облікові дані телефону було створено з порожнім кодом підтвердження SMS.",
      "missing-continue-uri": "У запиті необхідно вказати продовжену URL-адресу.",
      "missing-iframe-start": "Сталася внутрішня помилка.",
      "missing-ios-bundle-id": "Потрібно надати ідентифікатор iOS Bundle, якщо надається ідентифікатор App Store.",
      "missing-multi-factor-info": "Ідентифікатор другого фактора не надано.",
      "missing-multi-factor-session": "У запиті відсутній доказ успішного входу в систему першого фактора.",
      "missing-or-invalid-nonce": "Запит не містить дійсного nonce. Це може статися, якщо хеш SHA-256 наданого необробленого nonce не збігається з хешованим nonce у корисному навантаженні маркера ID.",
      "missing-phone-number": "Щоб надіслати коди підтвердження, вкажіть номер телефону одержувача.",
      "missing-verification-id": "Облікові дані телефону було створено з порожнім ідентифікатором підтвердження.",
      "app-deleted": "Цей екземпляр FirebaseApp було видалено.",
      "account-exists-with-different-credential": "Вже існує обліковий запис із тією самою адресою електронної пошти, але іншими обліковими даними для входу. Увійдіть за допомогою постачальника, пов’язаного з цією адресою електронної пошти.",
      "network-request-failed": "Сталася помилка мережі (така як тайм-аут, перерване з'єднання або недоступний хост).",
      "no-auth-event": "Сталася внутрішня помилка.",
      "no-such-provider": "Користувач не був прив'язаний до облікового запису даного постачальника.",
      "null-user": "Ненульовий об'єкт користувача було надано як аргумент для операції, яка вимагає ненульовий об'єкт користувача.",
      "operation-not-allowed": "Цей постачальник послуг входу вимкнено для цього проекту Firebase. Увімкніть його на консолі Firebase на вкладці методів входу в розділі Auth.",
      "operation-not-supported-in-this-environment": "Ця операція не підтримується в середовищі, де працює ця програма. \"location.protocol\" має бути http, https або chrome-extension, а веб-сховище має бути увімкнено.",
      "popup-blocked": "Неможливо встановити з'єднання зі спливаючим вікном. Можливо, воно було заблоковано браузером.",
      "popup-closed-by-user": "Спливаюче вікно було закрито користувачем перед завершенням операції.",
      "provider-already-linked": "Користувач може бути пов'язаний лише з одним ідентифікатором для даного постачальника.",
      "quota-exceeded": "Квота проекту для цієї операції перевищено.",
      "redirect-cancelled-by-user": "Операцію перенаправлення було скасовано користувачем перед завершенням.",
      "redirect-operation-pending": "Операція входу переспрямування вже очікує на розгляд.",
      "rejected-credential": "Запит містить неправильно сформовані або невідповідні облікові дані.",
      "second-factor-already-in-use": "Другий фактор уже зареєстровано на цьому обліковому записі.",
      "maximum-second-factor-count-exceeded": "Було перевищено максимальну дозволену кількість секундних факторів для користувача.",
      "tenant-id-mismatch": "Наданий ідентифікатор клієнта не збігається з ідентифікатором клієнта примірника Auth",
      "timeout": "Час очікування операції минув.",
      "user-token-expired": "Облікові дані користувача більше недійсні. Користувач повинен увійти знову.",
      "too-many-requests": "Ми заблокували всі запити з цього пристрою через незвичну активність. Спробуйте пізніше.",
      "unauthorized-continue-uri": "Домен продовженої URL-адреси не внесено до білого списку. Додайте домен у білий список у консолі Firebase.",
      "unsupported-first-factor": "Реєстрація другого фактора або вхід за допомогою багатофакторного облікового запису потребує входу за допомогою підтримуваного першого фактора.",
      "unsupported-persistence-type": "Поточне середовище не підтримує вказаний тип збереження.",
      "unsupported-tenant-operation": "Ця операція не підтримується в контексті кількох клієнтів.",
      "unverified-email": "Для операції потрібна підтверджена електронна адреса.",
      "user-cancelled": "Користувач не надав вашій програмі дозволи, які вона запитувала.",
      "user-not-found": "Немає жодного запису користувача, який би відповідав цьому ідентифікатору. Можливо, користувача було видалено.",
      "user-disabled": "Обліковий запис користувача було вимкнено адміністратором.",
      "user-mismatch": "Надані облікові дані не відповідають попередньому входу користувача.",
      "weak-password": "Пароль має містити 6 або більше символів.",
      "web-storage-unsupported": "Цей веб-переглядач не підтримується, або сторонні файли cookie та дані можуть бути вимкнені."
    },
    "footerText": "Виробляється в Україні"
  },
  "sideContainer": {
    "chatListIsEmpty": "Немає розпочатих чатів"
  }
}
